Config/DataProcessors/ОбменГИСГМП2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбменГИСГМП2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Участник</Name>
					<Comment>Участник прямого взаимодействия, организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Enums/ТипыУчастниковГИСГМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыУчастниковГИСГМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АЗ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/РезультатыОтправкиСообщенийВСМЭВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РезультатыОтправкиСообщенийВСМЭВ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринятСМЭВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработанБезОшибок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработанЕстьОшибки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПрошелАсинхроннуюПроверку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереведенВАрхив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученПолучателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненПолучателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПроцессеОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженВКаталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокХраненияСообщения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ЗапросУНИФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗапросУНИФО</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Для АН-контрагентов - участник прямого взаимодействия, для АН-организаций, сам АН</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗапрашиваемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИдентификатораДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КвитанцияНаОплатуГосуслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтПодведомственного</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвитированиеБезПлатежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатЭП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомерСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСертификата</Name>
					<Comment>Данные сертификата в кодировке base64</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участник</Name>
					<Comment>участник косвенного взаимодействия</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыОтправкиСообщенийВСМЭВ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраницаРезультата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУчастника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУчастниковГИСГМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженоДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОставлятьРаспределенныеПлатежи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЧастичногоКвитирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОперацииЧастичногоКвитирования</Name>
					<Comment>Поле reconcileID запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗапрашиваемыеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПлатежВОплатуГосуслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.УведомлениеОВозвратеГИСГМПОтПодведомственного</v8:Type>
								<v8:Type>cfg:DocumentRef.КвитанцияНаОплатуГосуслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.НачислениеОтПодведомственного</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежПодведомственному</v8:Type>
								<v8:Type>cfg:DocumentRef.УведомлениеОВозвратеГИСГМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Comment>Подведомственный участник</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборПоКБК</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КБК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/DataProcessors/ОбменГИСГМП2/Forms/ФормаСозданияЗапросаАЗ/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоЗапросНачислений = (Параметры.ВидЗапроса = "Начисления");
	
	Если ЭтоЗапросНачислений Тогда
		Элементы.ГруппаСтраницыЗапросов.ТекущаяСтраница = Элементы.ГруппаСтраницаЗапросаНачислений;
	Иначе
		Элементы.ГруппаСтраницыЗапросов.ТекущаяСтраница = Элементы.ГруппаСтраницаЗапросаПлатежей;
	КонецЕсли;
	
	ЗаполнитьТаблицуОрганизацийНаСервере();
	
	ТипЗапросаНачислений = "CHARGE";//по умолчанию
	ТипЗапросаПлатежей = "PAYMENT";//по умолчанию
	ВидПлательщика = "2";//юр. лицо - резидент
	
	Элементы.ГруппаСтраницыУсловий.ТекущаяСтраница = Элементы.ГруппаСтраницаИдПлат;// по умолчанию
	Элементы.ГруппаСтраницыОрганизацииОбычныеПлательщики.ТекущаяСтраница = Элементы.ГруппаОбычныеПлательщики;//по умолчанию
	Если Параметры.ЗапросНачисленийОрганизаций Тогда
		УсловияОтборовНачислений = 3;
		Элементы.ГруппаСтраницыОрганизацииОбычныеПлательщики.ТекущаяСтраница = Элементы.ГруппаСтраницаОрганизации;	
	КонецЕсли;
	Элементы.ГруппаСтраницыУсловийЗапросаПлатежей.ТекущаяСтраница = Элементы.ГруппаПлатежиПоУИН;// по умолчанию
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	КолКБК = ТаблицаКБК.Количество();
КонецПроцедуры


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УсловияОтборовНачилсенийПриИзменении(Элемент)
	Если УсловияОтборовНачислений = 0 Тогда
		Элементы.ГруппаСтраницыУсловий.ТекущаяСтраница = Элементы.ГруппаСтраницаИдПлат;
		Элементы.ГруппаСтраницыОрганизацииОбычныеПлательщики.ТекущаяСтраница = Элементы.ГруппаОбычныеПлательщики;
	ИначеЕсли УсловияОтборовНачислений = 1 Тогда
		Элементы.ГруппаСтраницыУсловий.ТекущаяСтраница = Элементы.ГруппаСтраницаУИН;
	ИначеЕсли УсловияОтборовНачислений = 2 Тогда
		Элементы.ГруппаСтраницыУсловий.ТекущаяСтраница = Элементы.ГруппаСтраницаВременнойИнтервал;
	ИначеЕсли УсловияОтборовНачислений = 3 Тогда
		Элементы.ГруппаСтраницыУсловий.ТекущаяСтраница = Элементы.ГруппаСтраницаИдПлат;
		Элементы.ГруппаСтраницыОрганизацииОбычныеПлательщики.ТекущаяСтраница = Элементы.ГруппаСтраницаОрганизации;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УсловияОтборовПлатежейПриИзменении(Элемент)
	Если УсловияОтборовПлатежей = 0 Тогда
		Элементы.ГруппаСтраницыУсловийЗапросаПлатежей.ТекущаяСтраница = Элементы.ГруппаПлатежиПоУИН;
	ИначеЕсли УсловияОтборовПлатежей = 1 Тогда
		Элементы.ГруппаСтраницыУсловийЗапросаПлатежей.ТекущаяСтраница = Элементы.ГруппаПлатежиПоИдПлат;
	ИначеЕсли УсловияОтборовПлатежей = 2 Тогда
		Элементы.ГруппаСтраницыУсловийЗапросаПлатежей.ТекущаяСтраница = Элементы.ГруппаПлатежиПоУИП;
	ИначеЕсли УсловияОтборовПлатежей = 3 Тогда
		Элементы.ГруппаСтраницыУсловийЗапросаПлатежей.ТекущаяСтраница = Элементы.ГруппаПлатежиЗаВременнойИнтервал;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидИдентификатораПриИзменении(Элемент)
	Если ВидИдентификатора = 0 Тогда
		Элементы.ГруппаИдентификаторПлательщикаИНН.ТекущаяСтраница = Элементы.ГруппаИдПлат;
	Иначе
		Элементы.ГруппаИдентификаторПлательщикаИНН.ТекущаяСтраница = Элементы.ГруппаИНН;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПлательщикаПриИзменении(Элемент)
	Если ВидПлательщика = "1" Тогда
		ВидИдентификатора = 0;		
	ИначеЕсли ВидПлательщика = "2" Тогда
		//ничего не надо
	ИначеЕсли ВидПлательщика = "3" Тогда
		ВидИдентификатора = 0;
	ИначеЕсли ВидПлательщика = "4" Тогда
		ВидИдентификатора = 0;
	КонецЕсли;
	
	Элементы.ВидИдентификатора.ТолькоПросмотр = (ВидПлательщика <> "2");
	
	Если ВидИдентификатора = 0 Тогда
		Элементы.ГруппаИдентификаторПлательщикаИНН.ТекущаяСтраница = Элементы.ГруппаИдПлат;
	Иначе
		Элементы.ГруппаИдентификаторПлательщикаИНН.ТекущаяСтраница = Элементы.ГруппаИНН;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОрганизации

&НаКлиенте
Процедура ТаблицаУчастникиИспользоватьПриИзменении(Элемент)
	ТекДанные = Элементы.ТаблицаОрганизации.ТекущиеДанные;
	Для Каждого ТекИд Из Элементы.ТаблицаОрганизации.ВыделенныеСтроки Цикл
		ТекСтр = ТаблицаОрганизации.НайтиПоИдентификатору(ТекИд);
		ТекСтр.Использовать = ТекДанные.Использовать;		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаКБК

&НаКлиенте
Процедура ТаблицаКБК3ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	КолКБК = ТаблицаКБК.Количество();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКБК3ПослеУдаления(Элемент)
	КолКБК = ТаблицаКБК.Количество();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКБК2ПослеУдаления(Элемент)
	КолКБК = ТаблицаКБК.Количество();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКБК2ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	КолКБК = ТаблицаКБК.Количество();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКБКПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	КолКБК = ТаблицаКБК.Количество();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКБКПослеУдаления(Элемент)
	КолКБК = ТаблицаКБК.Количество();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКБК1ПослеУдаления(Элемент)
	КолКБК = ТаблицаКБК.Количество();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКБК1ПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	КолКБК = ТаблицаКБК.Количество();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьИдентификатор(Команда)
	ДобавляемыйИдентификатор = "";
	ТекстСообщения = "";
	Отказ = Ложь;
		
	Если ВидПлательщика = "2"
		И ВидИдентификатора = 1 Тогда
		//это юр. лицо
		//это ИНН юр. лица
		ТекИНН = СокрЛП(ИНН);
		Если ЗначениеЗаполнено(ТекИНН) Тогда
			
			Если СтрДлина(ТекИНН) = 10 Тогда
				//все ок
			Иначе
				ТекстСообщения = Нстр("ru='Поле ""ИНН"" заполнено не корректно.
					|Значение должно быть 10 символов.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ИНН",,Отказ);
			КонецЕсли;
			
		Иначе
			ТекстСообщения = Нстр("ru='Поле ""ИНН"" не заполнено.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ИНН",,Отказ);
		КонецЕсли;
		Если Отказ = Ложь Тогда
			ДобавляемыйИдентификатор = ТекИНН;
		КонецЕсли;
	Иначе
		//идентификатор плательщика
		
		ТекИД = СокрЛП(ИдентификаторПлательщика);
		Если ЗначениеЗаполнено(ТекИД) Тогда
			
			ДлинаПоля = СтрДлина(ТекИД);
			Если ДлинаПоля = 22 Тогда
				//все ок
			Иначе
				
				ТекстСообщения = Нстр("ru='Поле ""Идентификатор плательщика"" заполнено не корректно.
					|Значение должно быть 22 символа. Сейчас %1'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,ДлинаПоля);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ИдентификаторПлательщика",,Отказ);
			КонецЕсли;
			
		Иначе
			ТекстСообщения = Нстр("ru='Поле ""Идентификатор плательщика"" не заполнено.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ИдентификаторПлательщика",,Отказ);
		КонецЕсли;
		Если Отказ = Ложь Тогда
			ДобавляемыйИдентификатор = ТекИД;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДобавляемыйИдентификатор) Тогда
		ДобавитьИдентификаторВТаблицу(ДобавляемыйИдентификатор);
		ИдентификаторПлательщика = "";
		ИНН = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗапросы(Команда)
	Отказ = Ложь;
	
	//проверка заполнения
	Если ЭтоЗапросНачислений Тогда
		Если УсловияОтборовНачислений = 0 Тогда // ИдПлат
			Если ТаблицаИдентификаторов.Количество()=0 Тогда
				ТекстСообщения = Нстр("ru='Не указаны идентификаторы плательщика для запроса.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаИдентификаторов",,Отказ);
			КонецЕсли;
			
			Если ТаблицаИдентификаторов.Количество()>100 Тогда
				ТекстСообщения = Нстр("ru='Допустимо указывать не более 100 идентификаторов плательщика для отбора.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаИдентификаторов",,Отказ);
			КонецЕсли; 
			
			Для Каждого СтрТЧ Из ТаблицаИдентификаторов Цикл
				ДлинаПоля = СтрДлина(СтрТЧ.ИдентификаторПлательщика);
				Если ДлинаПоля <> 22
					И ДлинаПоля <> 10 Тогда
					ТекстСообщения = Нстр("ru='В таблице идентификаторов плательщика указано значение %1 длиной %2.
						|Допустимы значения длиной 10 (ИНН юр. лица) или 22(идентификатор) симоволов.'");
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрТЧ.ИдентификаторПлательщика,ДлинаПоля);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаИдентификаторов",,Отказ);
				КонецЕсли;
			КонецЦикла;
				
			Если ЗначениеЗаполнено(ДатаНачала)
				ИЛИ ЗначениеЗаполнено(ДатаОкончания) Тогда
				
				//если заполнена одна дата, надо заполнить обе
				Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
					ТекстСообщения = Нстр("ru='Если требуется запрос за определенный временной интервал,
						|то нужно заполнить обе даты - начала и окончания.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаНачала",,Отказ);
				КонецЕсли;	
				Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
					ТекстСообщения = Нстр("ru='Если требуется запрос за определенный временной интервал,
						|то нужно заполнить обе даты - начала и окончания.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаОкончания",,Отказ);
				КонецЕсли;
				
			КонецЕсли;
						
			Для Каждого СтрТЧ Из ТаблицаКБК Цикл
				Если СтрТЧ.КБК = "0" 
					ИЛИ СтрДлина(СокрЛП(СтрТЧ.КБК)) = 20 Тогда
					//все ок
				Иначе
					ТекстСообщения = Нстр("ru='В таблице КБК указано значение %1 длиной %2.
						|Допустимые значения: 0, КБК из 20 символов.'");
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрТЧ.КБК,СтрДлина(СтрТЧ.КБК));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаКБК",,Отказ);
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли УсловияОтборовНачислений = 1 Тогда
			//по УИН
			
			Если ТаблицаУИН.Количество()=0 Тогда
				ТекстСообщения = Нстр("ru='Не указаны идентификаторы начислений для запроса.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаУИН",,Отказ);
			КонецЕсли;
			
			Если ТаблицаУИН.Количество()>100 Тогда
				ТекстСообщения = Нстр("ru='Допустимо указывать не более 100 идентификаторов начислений для отбора.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаУИН",,Отказ);
			КонецЕсли;
			
			Для Каждого СтрТЧ Из ТаблицаУИН Цикл
				ДлинаУИН = СтрДлина(СтрТЧ.УИН);
				Если ДлинаУИН <> 20
					И ДлинаУИН <> 25 Тогда
					ТекстСообщения = Нстр("ru='В таблице уникальных иденитификаторов начислений указано значение %1 длиной %2.
						|Допустимы значения длиной 20 или 25 симоволов'");
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрТЧ.УИН,ДлинаУИН);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаУИН",,Отказ);
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли УсловияОтборовНачислений = 2 Тогда
			//за временной интервал
			
			//надо заполнить обе даты
			Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
				ТекстСообщения = Нстр("ru='Если требуется запрос за определенный временной интервал,
					|то нужно заполнить обе даты - начала и окончания.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаНачала",,Отказ);
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
				ТекстСообщения = Нстр("ru='Если требуется запрос за определенный временной интервал,
					|то нужно заполнить обе даты - начала и окончания.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаОкончания",,Отказ);
			КонецЕсли;
						
			Для Каждого СтрТЧ Из ТаблицаКБК Цикл
				Если СтрТЧ.КБК = "0" 
					ИЛИ СтрДлина(СокрЛП(СтрТЧ.КБК)) = 20 Тогда
					//все ок
				Иначе
					ТекстСообщения = Нстр("ru='В таблице КБК указано значение %1 длиной %2.
						|Допустимые значения: 0, КБК из 20 символов.'");
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрТЧ.КБК,СтрДлина(СтрТЧ.КБК));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаКБК",,Отказ);
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли УсловияОтборовНачислений = 3 Тогда // организации ИБ
			КоличествоОтмеченныхОрганизаций = ТаблицаОрганизации.НайтиСтроки(Новый Структура("Использовать",Истина)).Количество();
			Если КоличествоОтмеченныхОрганизаций=0 Тогда
				ТекстСообщения = Нстр("ru='Не отмечены организации для запроса данных.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаОрганизаций",,Отказ);
			КонецЕсли;
			
			Если КоличествоОтмеченныхОрганизаций>100 Тогда
				ТекстСообщения = Нстр("ru='Допустимо указывать не более 100 организаций.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаОрганизаций",,Отказ);
			КонецЕсли; 
			
			Для Каждого СтрТЧ Из ТаблицаОрганизации Цикл
				Если СтрТЧ.Использовать = Ложь Тогда
					Продолжить;
				КонецЕсли;
				ДлинаПоля = СтрДлина(СокрЛП(СтрТЧ.ИНН));
				Если ДлинаПоля <> 10 Тогда
					ТекстСообщения = Нстр("ru='У организации %1 указан не корректный ИНН %2.
						|Длина ИНН должна быть 10 символов, у организации ИНН %3 символов.'");
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрТЧ.Организация,СтрТЧ.ИНН,ДлинаПоля);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаОрганизаций",,Отказ);
				КонецЕсли;
			КонецЦикла;
				
			Если ЗначениеЗаполнено(ДатаНачала)
				ИЛИ ЗначениеЗаполнено(ДатаОкончания) Тогда
				
				//если заполнена одна дата, надо заполнить обе
				Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
					ТекстСообщения = Нстр("ru='Если требуется запрос за определенный временной интервал,
						|то нужно заполнить обе даты - начала и окончания.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаНачала",,Отказ);
				КонецЕсли;	
				Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
					ТекстСообщения = Нстр("ru='Если требуется запрос за определенный временной интервал,
						|то нужно заполнить обе даты - начала и окончания.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаОкончания",,Отказ);
				КонецЕсли;
				
			КонецЕсли;
						
			Для Каждого СтрТЧ Из ТаблицаКБК Цикл
				Если СтрТЧ.КБК = "0" 
					ИЛИ СтрДлина(СокрЛП(СтрТЧ.КБК)) = 20 Тогда
					//все ок
				Иначе
					ТекстСообщения = Нстр("ru='В таблице КБК указано значение %1 длиной %2.
						|Допустимые значения: 0, КБК из 20 символов.'");
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрТЧ.КБК,СтрДлина(СтрТЧ.КБК));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаКБК",,Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		// это запрос платежей
		Если УсловияОтборовПлатежей = 0 Тогда
			//по УИН
			Если ТаблицаУИН.Количество()=0 Тогда
				ТекстСообщения = Нстр("ru='Не указаны идентификаторы начислений для запроса.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаУИН",,Отказ);
			КонецЕсли;
			
			Если ТаблицаУИН.Количество()>100 Тогда
				ТекстСообщения = Нстр("ru='Допустимо указывать не более 100 идентификаторов начислений для отбора.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаУИН",,Отказ);
			КонецЕсли;
			
			Для Каждого СтрТЧ Из ТаблицаУИН Цикл
				ДлинаУИН = СтрДлина(СтрТЧ.УИН);
				Если ДлинаУИН <> 20
					И ДлинаУИН <> 25 Тогда
					ТекстСообщения = Нстр("ru='В таблице уникальных иденитификаторов начислений указано значение %1 длиной %2.
						|Допустимы значения длиной 20 или 25 симоволов'");
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрТЧ.УИН,ДлинаУИН);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаУИН",,Отказ);
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ДатаНачала)
				ИЛИ ЗначениеЗаполнено(ДатаОкончания) Тогда
				
				//если заполнена одна дата, надо заполнить обе
				Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
					ТекстСообщения = Нстр("ru='Если требуется запрос за определенный временной интервал,
						|то нужно заполнить обе даты - начала и окончания.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаНачала",,Отказ);
				КонецЕсли;	
				Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
					ТекстСообщения = Нстр("ru='Если требуется запрос за определенный временной интервал,
						|то нужно заполнить обе даты - начала и окончания.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаОкончания",,Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли УсловияОтборовПлатежей = 1 Тогда
			//по ид.плат
			
			Если ТаблицаИдентификаторов.Количество()=0 Тогда
				ТекстСообщения = Нстр("ru='Не указаны идентификаторы плательщика для запроса.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаИдентификаторов",,Отказ);
			КонецЕсли;
			
			Если ТаблицаИдентификаторов.Количество()>100 Тогда
				ТекстСообщения = Нстр("ru='Допустимо указывать не более 100 идентификаторов плательщика для отбора.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаИдентификаторов",,Отказ);
			КонецЕсли; 
			
			Для Каждого СтрТЧ Из ТаблицаИдентификаторов Цикл
				ДлинаПоля = СтрДлина(СтрТЧ.ИдентификаторПлательщика);
				Если ДлинаПоля <> 22 Тогда
					ТекстСообщения = Нстр("ru='В таблице идентификаторов плательщика указано значение %1 длиной %2.
						|Допустимы значения длиной 22 симовола.'");
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрТЧ.ИдентификаторПлательщика,ДлинаПоля);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаИдентификаторов",,Отказ);
				КонецЕсли;
			КонецЦикла;
				
			Если ЗначениеЗаполнено(ДатаНачала)
				ИЛИ ЗначениеЗаполнено(ДатаОкончания) Тогда
				
				//если заполнена одна дата, надо заполнить обе
				Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
					ТекстСообщения = Нстр("ru='Если требуется запрос за определенный временной интервал,
						|то нужно заполнить обе даты - начала и окончания.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаНачала",,Отказ);
				КонецЕсли;	
				Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
					ТекстСообщения = Нстр("ru='Если требуется запрос за определенный временной интервал,
						|то нужно заполнить обе даты - начала и окончания.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаОкончания",,Отказ);
				КонецЕсли;
				
			КонецЕсли;
						
			Для Каждого СтрТЧ Из ТаблицаКБК Цикл
				Если СтрТЧ.КБК = "0" 
					ИЛИ СтрДлина(СокрЛП(СтрТЧ.КБК)) = 20 Тогда
					//все ок
				Иначе
					ТекстСообщения = Нстр("ru='В таблице КБК указано значение %1 длиной %2.
						|Допустимые значения: 0, КБК из 20 символов.'");
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрТЧ.КБК,СтрДлина(СтрТЧ.КБК));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаКБК",,Отказ);
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли УсловияОтборовПлатежей = 2 Тогда
			//По УИП
			Если ТаблицаУИП.Количество()=0 Тогда
				ТекстСообщения = Нстр("ru='Не указаны идентификаторы платежей для запроса.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаУИП",,Отказ);
			КонецЕсли;
			
			Если ТаблицаУИП.Количество()>100 Тогда
				ТекстСообщения = Нстр("ru='Допустимо указывать не более 100 идентификаторов платежей для отбора.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаУИП",,Отказ);
			КонецЕсли;
			
			Для Каждого СтрТЧ Из ТаблицаУИП Цикл
				ДлинаУИП = СтрДлина(СтрТЧ.УИП);
				Если ДлинаУИП <> 32 Тогда
					ТекстСообщения = Нстр("ru='В таблице уникальных иденитификаторов платежей указано значение %1 длиной %2.
						|Допустимы значения длиной 32 симоволов'");
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрТЧ.УИП,ДлинаУИП);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаУИП",,Отказ);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли УсловияОтборовПлатежей = 3 Тогда
			//временной интервал
			
			//надо заполнить обе даты
			Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
				ТекстСообщения = Нстр("ru='Если требуется запрос за определенный временной интервал,
					|то нужно заполнить обе даты - начала и окончания.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаНачала",,Отказ);
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
				ТекстСообщения = Нстр("ru='Если требуется запрос за определенный временной интервал,
					|то нужно заполнить обе даты - начала и окончания.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ДатаОкончания",,Отказ);
			КонецЕсли;
						
			Для Каждого СтрТЧ Из ТаблицаКБК Цикл
				Если СтрТЧ.КБК = "0" 
					ИЛИ СтрДлина(СокрЛП(СтрТЧ.КБК)) = 20 Тогда
					//все ок
				Иначе
					ТекстСообщения = Нстр("ru='В таблице КБК указано значение %1 длиной %2.
						|Допустимые значения: 0, КБК из 20 символов.'");
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,СтрТЧ.КБК,СтрДлина(СтрТЧ.КБК));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ТаблицаКБК",,Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
					
	КонецЕсли;
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	МассивДокументов = Новый Массив;
	СформироватьЗапросыНаСервере(МассивДокументов);
	Если МассивДокументов.Количество()= 1 Тогда
		ОповеститьОбИзменении(МассивДокументов[0]);
	ИначеЕсли МассивДокументов.Количество()>1 Тогда
		ОповеститьОбИзменении(Тип("ДокументСсылка.ЗапросУНИФО"));
	КонецЕсли;
	
	Закрыть(МассивДокументов);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИдентификатор(Команда)
	ПараметрыФормы = Новый Структура("ВидПлательщика",ВидПлательщика);
	
	ОписаниеОпов = Новый ОписаниеОповещения("ПослеФормированияИдентификатора",ЭтотОбъект);
	
	ОткрытьФорму("Обработка.ОбменГИСГМП2.Форма.ФормаФормированияИдентификатора",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОпов,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеФормированияИдентификатора(Результат,ДопПараметры)Экспорт
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьИдентификаторВТаблицу(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуОрганизаций(Команда)
	ЗаполнитьТаблицуОрганизацийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	ИзменитьОтметку(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуВсе(Команда)
	ИзменитьОтметку(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьИдентификаторВТаблицу(ДобавляемыйИдентификатор)
	
	Если ТаблицаИдентификаторов.НайтиСтроки(Новый Структура("ИдентификаторПлательщика",ДобавляемыйИдентификатор)).Количество()>0 Тогда
		ТекстСообщения = Нстр("ru='Идентификатор %1 уже есть в списке запрашиваемых'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,ДобавляемыйИдентификатор);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	НовСтр = ТаблицаИдентификаторов.Добавить();
	НовСтр.ИдентификаторПлательщика = ДобавляемыйИдентификатор;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗапросыНаСервере(МассивДокументов)
		
	Если ЭтоЗапросНачислений Тогда
		
		Если УсловияОтборовНачислений = 0 Тогда // ИдПлат
			
			МассивИНН = Новый Массив;
			МассивИдПлат = Новый Массив;
			Для Каждого СтрТЧ Из ТаблицаИдентификаторов Цикл
				ТекЗначение = СокрЛП(СтрТЧ.ИдентификаторПлательщика);
				ДлинаПоля = СтрДлина(ТекЗначение);
				Если ДлинаПоля = 22 Тогда
					МассивИдПлат.Добавить(ТекЗначение);
				ИначеЕсли ДлинаПоля = 10 Тогда
					МассивИНН.Добавить(ТекЗначение);
				КонецЕсли;
			КонецЦикла;			
			
			Если МассивИдПлат.Количество()>0 Тогда
				СоздатьДокументыЗапросаПоПараметрам(ТипЗапросаНачислений,"УИП",МассивИдПлат,Истина,ДатаНачала,ДатаОкончания,МассивДокументов);
				//МассивДокументов.Добавить(ЗапросСсылка);
			КонецЕсли;
			
			Если МассивИНН.Количество()>0 Тогда
				СоздатьДокументыЗапросаПоПараметрам(ТипЗапросаНачислений,"ИНН",МассивИНН,Истина,ДатаНачала,ДатаОкончания,МассивДокументов);
				//МассивДокументов.Добавить(ЗапросСсылка);
			КонецЕсли; 
			
		ИначеЕсли УсловияОтборовНачислений = 1 Тогда //УИН
			
			МассивУИН = ТаблицаУИН.Выгрузить().ВыгрузитьКолонку("УИН");
			СоздатьДокументыЗапросаПоПараметрам(ТипЗапросаНачислений,"УИН",МассивУИН,Ложь,Неопределено,Неопределено,МассивДокументов);
			//МассивДокументов.Добавить(ЗапросСсылка);
			
		ИначеЕсли УсловияОтборовНачислений = 2 Тогда //за временной интервал
			
			МассивПустой = Новый Массив;
			СоздатьДокументыЗапросаПоПараметрам(ТипЗапросаНачислений,"НЕТ",МассивПустой,Истина,ДатаНачала,ДатаОкончания,МассивДокументов);
			//МассивДокументов.Добавить(ЗапросСсылка);
			
		ИначеЕсли УсловияОтборовНачислений = 3 Тогда // Организации
			
			МассивИНН = Новый Массив;
			Для Каждого СтрТЧ Из ТаблицаОрганизации Цикл
				Если СтрТЧ.Использовать = Ложь Тогда
					Продолжить;
				КонецЕсли;
				ТекЗначение = СокрЛП(СтрТЧ.ИНН);
				ДлинаПоля = СтрДлина(ТекЗначение);
				Если ДлинаПоля = 10 Тогда
					МассивИНН.Добавить(ТекЗначение);
				КонецЕсли;
			КонецЦикла;			
						
			Если МассивИНН.Количество()>0 Тогда
				СоздатьДокументыЗапросаПоПараметрам(ТипЗапросаНачислений,"ИНН",МассивИНН,Истина,ДатаНачала,ДатаОкончания,МассивДокументов);
				//МассивДокументов.Добавить(ЗапросСсылка);
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		//платежи
		
		Если УсловияОтборовПлатежей = 0 Тогда //УИН
			
			МассивУИН = ТаблицаУИН.Выгрузить().ВыгрузитьКолонку("УИН");
			СоздатьДокументыЗапросаПоПараметрам(ТипЗапросаПлатежей,"УИН",МассивУИН,Ложь,ДатаНачала,ДатаОкончания,МассивДокументов);
			//МассивДокументов.Добавить(ЗапросСсылка);	
			
		ИначеЕсли УсловияОтборовПлатежей = 1 Тогда //Ид.Плат.
			
			МассивИдПлат = ТаблицаИдентификаторов.Выгрузить().ВыгрузитьКолонку("ИдентификаторПлательщика");
			СоздатьДокументыЗапросаПоПараметрам(ТипЗапросаПлатежей,"УИП",МассивИдПлат,Истина,ДатаНачала,ДатаОкончания,МассивДокументов);
			//МассивДокументов.Добавить(ЗапросСсылка);
			
		ИначеЕсли УсловияОтборовПлатежей = 2 Тогда //идентификаторы платежа
			
			МассивБИП = ТаблицаУИП.Выгрузить().ВыгрузитьКолонку("УИП");
			СоздатьДокументыЗапросаПоПараметрам(ТипЗапросаПлатежей,"БИП",МассивБИП,Ложь,Неопределено,Неопределено,МассивДокументов);
			//МассивДокументов.Добавить(ЗапросСсылка);
			
		ИначеЕсли УсловияОтборовПлатежей = 3 Тогда //за временной интервал
			
			МассивПустой = Новый Массив;
			СоздатьДокументыЗапросаПоПараметрам(ТипЗапросаПлатежей,"НЕТ",МассивПустой,Истина,ДатаНачала,ДатаОкончания,МассивДокументов);
			//МассивДокументов.Добавить(ЗапросСсылка);
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыЗапросаПоПараметрам(ТипЗапрашиваемыхДанных,ТипИдентификатораДанных,МассивИдентификаторов,ИспользуетсяОтборПоКБК,ТекДатаНачала,ТекДатаОкончания,МассивДокументов)
	
	Если Параметры.ИспользоватьОчередьЗапросовГИСГМП Тогда
		
		КоличествоЧасов = 0; // сейчас не разделяется на периоды
		
		ТипУчастникаГИСГМП = Перечисления.ТипыУчастниковГИСГМП.АЗ;
		СтруктураПараметров = ГосУслуги.ПараметрыДляФормированияЗаписейРегистровЗапросаКГИСГМП(ТекДатаНачала,
			ТекДатаОкончания,КоличествоЧасов,ТипЗапрашиваемыхДанных,ТипИдентификатораДанных,ТипУчастникаГИСГМП);
			
		Если МассивИдентификаторов<>Неопределено Тогда
			СтруктураПараметров.МассивОтборПоИдентификаторам = МассивИдентификаторов;		
		КонецЕсли;
		
		Если ИспользуетсяОтборПоКБК Тогда
			МассивКБК = ТаблицаКБК.Выгрузить().ВыгрузитьКолонку("КБК");
			СтруктураПараметров.МассивОтборПоКБК = МассивКБК;
		КонецЕсли;
		ОшибкаСозданияЗапроса = Ложь;
		ТекстОшибки = "";	
		ГосУслуги.СформироватьЗаписиРегистровЗапросаКГИСГМП(Параметры.Участник, СтруктураПараметров, Параметры.МассивФорматовЭкспорта,ОшибкаСозданияЗапроса,ТекстОшибки);
		
		Если ОшибкаСозданияЗапроса Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки); 
			Возврат;
		Иначе
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Запрос добавлен в очередь запросов к сервису'"));	
		КонецЕсли;
	Иначе
	
		ДокОбъект = Документы.ЗапросУНИФО.СоздатьДокумент();
		ДокОбъект.Дата = ТекущаяДата();
		ДокОбъект.Организация = Параметры.Участник;
		ДокОбъект.ТипЗапрашиваемыхДанных = ТипЗапрашиваемыхДанных;
		ДокОбъект.СтатусОбработки = Перечисления.РезультатыОтправкиСообщенийВСМЭВ.НеОтправлен;
		ДокОбъект.Комментарий = Комментарий;
		ДокОбъект.СтраницаРезультата = 1;
		ДокОбъект.ТипУчастника = Перечисления.ТипыУчастниковГИСГМП.АЗ;
		
		ДокОбъект.ТипИдентификатораДанных = ТипИдентификатораДанных;
		
		Если МассивИдентификаторов <> Неопределено Тогда
			Для Каждого ТекИд Из МассивИдентификаторов Цикл
				НовСтр = ДокОбъект.ЗапрашиваемыеДанные.Добавить();
				НовСтр.УИД = ТекИд;
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекДатаНачала)
			И ЗначениеЗаполнено(ТекДатаОкончания) Тогда
			ДокОбъект.ДатаНачала = ТекДатаНачала;
			ДокОбъект.ДатаОкончания = ТекДатаОкончания;
		КонецЕсли;
		
		Если ИспользуетсяОтборПоКБК = Истина Тогда
			КоличествоКБК = 0;
			
			Для Каждого СтрТЧ Из ТаблицаКБК Цикл
				
				Если КоличествоКБК = 10 Тогда
					//В документе не может быть более 10 КБК - ограничение формата
					ДокОбъект.Записать();
					МассивДокументов.Добавить(ДокОбъект.Ссылка);
					
					ДокОбъект = ДокОбъект.Скопировать();
					ДокОбъект.Дата = ТекущаяДата();
					ДокОбъект.ОтборПоКБК.Очистить();
					
					КоличествоКБК = 0;
				КонецЕсли;
				
				НовСтр = ДокОбъект.ОтборПоКБК.Добавить();
				НовСтр.КБК = СтрТЧ.КБК;
				
				КоличествоКБК = КоличествоКБК + 1;
				
			КонецЦикла;
		КонецЕсли;
			
		ДокОбъект.Записать();
		
		МассивДокументов.Добавить(ДокОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОрганизацийНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Организация,
		|	Организации.ИНН КАК ИНН,
		|	ВЫБОР
		|		КОГДА ДЛИНАСТРОКИ(СОКРЛП(Организации.ИНН)) = 10
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Использовать
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организации.Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
		
	ТаблицаОрганизации.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтметку(Значение)
	Для Каждого СтрТЧ Из ТаблицаОрганизации Цикл
		Если СтрДлина(СокрЛП(СтрТЧ.ИНН)) = 10 Тогда
			СтрТЧ.Использовать = Значение;
		Иначе
			СтрТЧ.Использовать = Ложь;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры




#КонецОбласти
